app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "picture_id", "text", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = session[:login]
    respond_to do |format|
      if @comment.save