app/controllers/friendships_controller.rb

SELECT id,friend_id FROM "friendships" WHERE "friendships"."user_id" = 1
---
  def index
    logger.info("-------------->index Friendship session #{session[:login]}");
    if request.format.json?
        friendships_instance =Friendship.new
        @friendships = friendships_instance.getMyfriends(session[:login]);
    else
        @friendships=Friendship.where(user_id: session[:login])

SELECT id,user_id FROM "friendships" WHERE "friendships"."friend_id" = 1
---
    def set_friendship
      @friendship = Friendship.find(params[:id])