app/controllers/likes_controller.rb

  def create
    @like = Like.new(like_params)
    @like.user_id = session[:login]
    newLike = Like.where(picture_id: "#{@like.picture_id}", user_id: "#{session[:login]}").first
    if newLike ==nil
      respond_to do |format|
        if @like.save
---
SELECT "likes".* FROM "likes" WHERE "likes"."picture_id" = 1 AND "likes"."user_id" = 1 ORDER BY "likes"."id" ASC LIMIT 1
INSERT INTO "likes" ("created_at", "picture_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 28 Mar 2014 06:26:42 UTC +00:00], ["picture_id", 1], ["updated_at", Fri, 28 Mar 2014 06:26:42 UTC +00:00], ["user_id", 1]]

  def destroy
    @like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]

    def set_like
      @like = Like.find(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT 1  [["id", "1"]]