app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.all.order("id desc").limit(15).offset(0)
---
SELECT "pictures".* FROM "pictures" ORDER BY id desc LIMIT 15 OFFSET 0

  def getPictureByCountry
     countryID = params[:id]
     if countryID == "-1"
      @pictures=[]
      timelines = Timeline.where(user_id: "#{session[:login]}").order("id desc")
      timelines.each do |timeline|
         picture = Picture.where(id:"#{timeline.picture_id}").first
---
SELECT "timelines".* FROM "timelines" WHERE "timelines"."user_id" = 1 ORDER BY id desc
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 1 ORDER BY "pictures"."id" ASC LIMIT 1

  def create
      # if request.format.json?
    #@userfile = params[:picture][:picture_url]


    @userfile = params[:picture]
    path = save_file( @userfile)
    #logger.info("pic file #{@userfile}");
    logger.info("-------------->Picture session #{session[:login]}");
    @picture = Picture.new(picture_url: path)

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("created_at", "picture_url", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 28 Mar 2014 06:26:26 UTC +00:00], ["picture_url", "files/2303c6aa14691f4ce690287ed15bd7ac63847872.png"], ["updated_at", Fri, 28 Mar 2014 06:26:26 UTC +00:00]]