app/controllers/timelines_controller.rb

SELECT "countries".* FROM "countries" WHERE "countries"."country_name" = 'Japan' ORDER BY "countries"."id" ASC LIMIT 1
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pictures" SET "country_id" = ?, "category_id" = ?, "updated_at" = ? WHERE "pictures"."id" = 1  [["country_id", 1], ["category_id", 1], ["updated_at", Fri, 28 Mar 2014 06:26:26 UTC +00:00]]
INSERT INTO "countries" ("country_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["country_name", "Japan"], ["created_at", Fri, 28 Mar 2014 06:26:26 UTC +00:00], ["updated_at", Fri, 28 Mar 2014 06:26:26 UTC +00:00]]
INSERT INTO "timelines" ("created_at", "picture_id", "text", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    logger.info("-------------->timelines session #{session[:login]}");
    @timeline = Timeline.new(timeline_params)
    logger.info("picture_id #{@timeline.picture_id}")
    country = Country.where(country_name: "#{params[:country]}").first

    if country!=nil
        logger.info("not null and id is #{country.id}")
        Picture.find(@timeline.picture_id).update(country_id: "#{country.id}",category_id: "#{params[:type]}")
    else
        country = Country.new(country_name: "#{params[:country]}")
        country.save

SELECT "timelines".* FROM "timelines" WHERE (user_id=1)
---
    def set_timeline
      @timeline = Timeline.find(params[:id])