app/controllers/users_controller.rb

  def show
    totalPicture=Timeline.where("user_id=#{@user.id}").count
---
SELECT COUNT(*) FROM "timelines" WHERE (user_id=1)

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "password", "profileImage", "updated_at", "username") VALUES (?, ?, ?, ?, ?)

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]